package main

import (
	"fmt"
	"testing"

	"github.com/stretchr/testify/assert"
)

func TestAnagramsSearch(t *testing.T) {
	//Arrange тестовая выборка
	testTable := []struct {
		input    []string
		expected map[string][]string
	}{
		{
			input: []string{"ребята", "конь", "Лошадь", "ЗаБоРчИк", "пятак", "слиток", "тапок", "листок", "Конь", "Лопата", "Пятак", "Тяпка",
				"тяпка", "листок", "листик", "Столик", "Слиток", "вертикаль", "материк", "пятка", "Керамит", "Мошкара", "Ромашка", "Торнадо",
				"апельсин", "спаниель", "норматив", "хористка", "минотавр", "Акростих"},
			expected: map[string][]string{
				"акростих": {"акростих", "хористка"},
				"апельсин": {"апельсин", "спаниель"},
				"керамит":  {"керамит", "материк"},
				"листок":   {"листок", "слиток", "столик"},
				"минотавр": {"минотавр", "норматив"},
				"мошкара":  {"мошкара", "ромашка"},
				"пятак":    {"пятак", "пятка", "тяпка"},
			},
		},
		{
			input: []string{"ребята", "конь", "Лошадь", "ЗаБоРчИк", "пятка", "Керамит", "Мошкара", "Ромашка", "Торнадо",
				"апельсин", "спаниель", "норматив", "хористка", "Акростих"},
			expected: map[string][]string{
				"акростих": {"акростих", "хористка"},
				"апельсин": {"апельсин", "спаниель"},
				"мошкара":  {"мошкара", "ромашка"},
			},
		},
		{
			input: []string{"Лошадь", "ЗаБоРчИк", "пятак", "слиток", "листок", "Конь", "Лопата", "Тяпка",
				"тяпка", "листок", "листик", "Столик", "вертикаль", "материк", "пятка", "Керамит", "Мошкара", "Ромашка", "Торнадо",
				"апельсин", "спаниель", "норматив", "минотавр", "Акростих"},
			expected: map[string][]string{
				"апельсин": {"апельсин", "спаниель"},
				"керамит":  {"керамит", "материк"},
				"листок":   {"листок", "слиток", "столик"},
				"минотавр": {"минотавр", "норматив"},
				"мошкара":  {"мошкара", "ромашка"},
				"пятак":    {"пятак", "пятка", "тяпка"},
			},
		},
		{
			input: []string{"тяпка", "листок", "листик", "Столик", "Слиток", "вертикаль", "материк", "пятка", "Керамит", "Мошкара", "Ромашка", "Торнадо",
				"спаниель", "норматив", "хористка", "минотавр"},
			expected: map[string][]string{
				"керамит":  {"керамит", "материк"},
				"листок":   {"листок", "слиток", "столик"},
				"минотавр": {"минотавр", "норматив"},
				"мошкара":  {"мошкара", "ромашка"},
				"пятка":    {"пятка", "тяпка"},
			},
		},
	}

	//Act расчет результата
	for _, testCase := range testTable {
		result := AnagramsSearch(testCase.input)

		t.Logf("Calling Unpack(%s), result %s\n", testCase.input, result)

		//Assert сравнение результата с ожиданием
		assert.Equal(t, testCase.expected, result,
			fmt.Sprintf("Incorrext result. Expect %s, got %s", testCase.expected, result))
	}
}
